{
    "python": {
        "stepName": "Test Python",
        "buttonName": "Check Python Version",
        "type": "test",
        "description": "This step verifies if Python (currently tested versions: version > 3.10.3 and < 3.12) is installed on your computer. Python is required for running SynthARium's backend application. Click the \"Check Python Version\" button below. If python is not detected, please follow instructions to install it at this link: <a href=\"https://www.python.org/downloads/release/python-3114/\" target=\"_blank\" rel=\"noreferrer\"><i>https://www.python.org/downloads/release/python-3114/</i></a>"
    },
    "node": {
        "stepName": "Test Node",
        "buttonName": "Check Node Version",
        "type": "test",
        "description": "This step verifies if Node.js (currently tested versions are > v16.0.0) is installed on your computer. Node.js is required for running SynthARium's frontend application. Click the \"Check Node Version\" button below. If Node is not detected, please follow instructions to install it at this link: <a href=\"https://nodejs.org/en/blog/release/v18.12.0\" target=\"_blank\" rel=\"noreferrer\"><i>https://nodejs.org/en/blog/release/v18.12.0</i></a>"
    },
    "git": {
        "stepName": "Test Git",
        "buttonName": "Check Git Version",
        "type": "test",
        "description": "This step verifies if Git is installed on your computer. Our installer uses Git to download the project and keep your SynthARium instance up-to-date with the latest changes and bug fixes. Click the \"Check Git Version\" button below. If Git is not detected, please follow instructions to install it at this link: <a href=\"https://git-scm.com/downloads\" target=\"_blank\" rel=\"noreferrer\"><i>https://git-scm.com/downloads</i></a>."
    },
    "ngrok": {
        "stepName": "Configure Ngrok",
        "buttonName": "Set ngrok Token",
        "type": "input",
        "description": "ngrok is optional and for the purposes of using SynthARium free. If you want other's outside your network to be able to access and join your experiment without too much hassle and the use of 3rd party software and data privacy isn't a restriction for you, we recommend using ngrok. You can sign up for ngrok here: If you wish to use ngrok, enter your ngrok authentication token in the input section below and click \"Set ngrok Token.\" "
    },
    "openAi": {
        "stepName": "Configure ChatGPT",
        "buttonName": "Set OpenAI Token",
        "type": "input",
        "description": "If you wish to use OpenAI's ChatGPT feature in SynthARium, please enter your API key below. To sign up for a OpenAI key, visit their website: <a href=\"https://platform.openai.com/\" target=\"_blank\" rel=\"noreferrer\"><i>https://platform.openai.com/</i></a> and check their pricing: <a href=\"https://openai.com/api/pricing/\" target=\"_blank\" rel=\"noreferrer\"><i>https://openai.com/api/pricing/</i></a> If you wish to use ChatGPT features for an experiment, enter your api authentecation token in the input section below and click \"Set OpenAI Token.\""
    },
    "openFace": {
        "stepName": "Configure OpenFace",
        "buttonName": "Install OpenFace",
        "type": "install",
        "description": "If you wish to use OpenFace as a real-time analysis filter in SynthARium without the hassel of building the model yourself, we offer a easier alternative through Docker. You must already have Docker installed: <a href=\"https://www.docker.com/products/docker-desktop\" target=\"_blank\" rel=\"noreferrer\"><i>https://www.docker.com/products/docker-desktop</i></a> then click the \"Install OpenFace\" button below. <br />Note: Installation of OpenFace requires at least 2.1 GB of free space (including the Docker installation, manual OpenFace build requires at least 3.3GB). Furthermore, be sure that your computer has mid range performance otherwise enabling one or more instances of OpenFace will make your system struggle."
    },
    "experimenterPassword": {
        "stepName": "Configure Password",
        "buttonName": "Set Experimenter Password",
        "type": "input",
        "description": "Experimenter Password is optional but recommended. Although hardcoded, it is a preliminary measures we immplemented to stop misdirected participants or malicious actors from accessing your experiments and tampering with your experimental settings. Enter a custom password and click the \"Set Experimenter Password\". If you forget your password, just reset it here. <br />Note: Anyone with your experimenter password and the hosting link can be able to join as an experimenter, even to a currently ongoing session."
    },
    "installProject": {
        "stepName": "Install Project",
        "buttonName": "Install Project Dependencies",
        "type": "install",
        "description": "Click the \"Install Dependencies\" button below to install all necessary backend and frontend dependencies for the project. You can click to expand and see logs of the installation process."
    },
    "launcher": {
        "stepName": "Launcher",
        "buttonName": "Launch",
        "type": "launch",
        "description": "You have successfully installed the project and ready to go! You can come to this page anytime to launch or terminate the project. When ready, a link will appear and clicking on it opens the SynthARium project in your default browser.\\ For more information about project usage, checkout our wiki: https://github.com/TUMFARSynchrony/SynthARium/wiki/Usage"
    }
}
